import random

speech_1 = ['Коллеги,', 'В то же время,', 'Однако,', 'Тем не менее,', 'Следовательно,', 'Соответственно,', 'Вместе с тем,', 'С другой стороны,']
speech_2 = ['парадигма цифровой экономики', 'контекст геймификации', 'дижитализация бизнес-процессов', 'прагматичный подход к облачным платформам', 'совокупность сквозных технологий', 'программа прорывных исследований', 'ускорение блокчейн-транзакций', 'экспоненциальный рост Big Data']
speech_3 = ['открывает новые возможности для', 'выдвигает новые требования', 'несет в себе риски', 'расширяет горизонты', 'заставляет искать варианты', 'не оставляет шанса для', 'повышает вероятность', 'обостряет проблему']
speech_4 = ['дальнейшего углубления', 'бюджетного финансирования', 'синергетического эффекта', 'компроментации конфиденциальных', 'несанкционированной кастомизации', 'нормативного регулирования', 'практического применения']
speech_5 = ['знаний и компетенций.', 'непроверенных гипотез.', 'волатильных активов.', 'опасных экспериментов.', 'государственно-частных партнеров.', 'цифровых следов граждан.', 'нежелательных последствий.', 'случайных открытий.']

# определяем количество генерируемых предложений случайным методом от 5 до 10
count = 1
max_count = random.randint(6, 10)

# объявляем цикл в котором перетасовываем все элементы массивов и выводим на экран первые элементы массива
while count < max_count:
    random.shuffle(speech_1)
    random.shuffle(speech_2)
    random.shuffle(speech_3)
    random.shuffle(speech_4)
    random.shuffle(speech_5)
    print(speech_1[0], speech_2[0], speech_3[0], speech_4[0], speech_5[0])
    count += 1
